# 1. 什么是面向过程？什么是面向对象？（多行注释）

"""面向过程就是分析出解决问题所需要的步骤，根据问题逻辑一步一步实现。
【把完成某一个需求的所有步骤 从头到尾逐步实现根据开发需求,将某些功能独立的代码 封装成一个又一个函数最后完成的代码,就是顺序地调用不同的函数】
面向对象是把问题中的事务分解成各个对象，建立对象的目的不是为了完成一个步骤，而是为了描叙某个事物在整个解决问题的步骤中的行为
【相比较函数,面向对象是更大的封装,根据职责在一个对象中封装多个方法在完成某一个需求前,首先确定职责--要做的事情(方法)根据职责确定不同的对象,在对象内部封装不同的方法(多个)最后完成的代码,就是顺序地让不同的对象调用不同的方法】"""

# 2. 为什么会出现面向对象的编程方式？面向对象解决了哪些问题？（多行注释）
"""面带对象编程在处理复杂问题时有特效，更加适合应对复杂的需求变化,是专门应对复杂项目开发,提供的固定套路"""

# 3. 什么是类？什么是对象？（多行注释）
"""类是对一群具有 相同特征或者行为的事物的一个统称
    对象是用类创造出的具体存在"""

# 4. 类包含哪些要素？（注意审题，不是面向对象的三要素，而是类包含的要素）
"""特征、行为。
查到的：封装性、继承、多态"""


