# 1.3.1 完善课堂练习 1.2 中 #1.2.3~1.2.6 的输出语句，不要单独打印变量，而是打印一句完整的话。例如 #1.2.3 的输出为 “小明实际需要支付的金额是 xxx 元”

# 1.3.2 开发一个计算圆的周长和面积的程序，用户输入圆的半径 r，在一行内打印圆的周长、面积，保留 2 位小数（π 取 3.14）

# 1.3.3 开发一个简单的欢迎程序，新生输入自己的姓名和年级后，控制台会显示 “欢迎 xxx 开始 xx 年级的学习”

# 1.3.4 使用 input() 输入你的姓名、性别、学号，按照下方格式打印所有信息（左右对齐即可）
'''
---- info ----
Name   :  Kros
Gender :  male
ID     :  0001
--------------
'''

# 1.3.5 赋值下列代码到文件，判断下列 4 个输出的结果（>>> 为输出），在每行 print 函数后，以注释的形式说明这行代码的效果，以及输出是否正确
'''
A. print("%.2f" % 123.45678)  # ……
   >>>  123.45
B. print("%.2f" % 123.4)
   >>>  123.40
C. print("%6.2f" % 1.2345)
   >>>  1.23
D. print("%06.2f" % 1.2345)
   >>>  1.23
E. print("%010.3f" % 3.1415926)
   >>>  00000000003.142
'''

# 1.3.6 打印两行数字，第 1 行为 8,9,10，第 2 行为 11,12,13，保证对齐

# 1.3.7 打印下方的五角星
'''
      *
     ***
*************
   *******
  ***   ***
 *         *
'''


# 1.3.8 创建 3 个变量，分别保存今天日期的年（2022）、月（9）、日（13），以 '-' 作为间隔符，使用 'today' 作为结束符，使用 print 函数打印出完整的日期
