# 3.1.1 比萨配料
# 编写一个循环，提示用户输入一系列的比萨配料
# 每当用户输入一种配料后，都打印出刚才添加的这种配料
# 用户输入 666 时结束程序

# 3.1.2 电影票：编写一个循环，不断询问不同用户的年龄，并根据观众的年龄指出其票价
# 不到 3 岁的观众免费
# 3-12 岁的观众为 10 美元
# 超过 12 岁的观众为 15 美元

# 3.1.3 小红将账户中价值 2 亿人民币的数字货币全部转出，购买了某公司的股票，但公司经营不善，每个月都缩水为原来的一半。小红从千万富翁沦落为穷光蛋（资产 < 10 元），需要几个月？此时她的资产是多少元？（打印一条消息表示）

# 3.1.4 猜数游戏 v2.0
# 在程序中设定一个 1-100 的数
# 让用户输入一个数，最多有 5 次机会
# 如果用户猜对了，打印消息通知
# 如果用户猜错了，显示 “猜大了” 或 “猜小了”

# 3.1.5 猜数游戏 v2.1
# 在程序中设定一个 1-100 的数
# 让用户输入一个数，用户可以一直猜，直到猜对为止
# 如果用户猜对了，打印消息通知
# 如果用户猜错了，告知误差范围：如果误差超过 50，打印 '离谱'；误差超过 30，打印 'nonono'；误差不超过 10，打印 'close!'

# 3.1.6 一次考试后，循环录入某班级 30 名学生的成绩，并计算平均分
# 如果分数超过 100 或小于 0，提示“分数有误，请重新输入”
# 30 名学生的成绩输入完成后，提示“录入完毕！平均分为 xx 分”，并结束程序

# 3.1.7 计算 1+2+3+……+100 的和

# 3.1.8 分别计算 1 到 100 中所有奇数、偶数的和

# 3.1.9 质数判断：用户输入一个正整数，用程序判断是否为质数

# 3.1.10 分解质因数：用户输入一个正整数，用程序进行分解质因数，如输出 30 = 2 * 3 * 5

# 3.1.11 制作一个动态的进度条（提示：使用 print 函数的 end 参数）
'''
import time
time.sleep(0.5)  # 程序暂停 0.5s
'''
