# 1.1.1. 将 "Hello World!" 保存到变量，打印到控制台
message = "Hello World!"
print(message)

# 1.1.2. 创建 1 个手机号变量，打印到控制台
phonenumber = "10086"
print(phonenumber)
# 1.1.3. 将 1 个用户名存储到变量中，打印到控制台；再修改 1 次用户名，将新的用户名打印到控制台
username = "小A"
print(username)
# 1.1.4. 创建 1 个初始值为零的变量，用于保存用户的账户余额，将初始余额打印到控制台
boc = 0
print(boc)
#boc是balance of account的缩写

# 1.1.5. 创建 1 个变量，用于存储股票代码，参考 深圳证券交易所-股票列表，将初始值打印到控制台
平安银行 = "000001"
print(平安银行)
#这一条不太懂啦
# 1.1.6. 创建 3 个变量，分别记录学生的姓名、性别、学号，逐行打印三个变量到控制台
姓名,性别,学号 = "小A" ,"未知" ,"123"
print(姓名,性别,学号)
